BACKEND/__performance__/test_performance.yml
config:
  target: "http://localhost:8080" 
  phases:
    - duration: 60 
      arrivalRate: 5

scenarios:
  - flow:
      - post:
          url: "/users/signin"
          json:
            usernameOrEmail: "mockUserencrypt"
            password: "mockPassword"
          capture:
            - json: $.token
              as: token
      - post:
          url: "/conversation/add"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            participant1: 1
            participant2: 2